In [1]:
import sqlite3
from datetime import datetime, timedelta

In [2]:
conn = sqlite3.connect('chuong_2.db')

cursor = conn.cursor()

In [4]:
#Tạo bảng student và course
cursor.execute('''CREATE TABLE student(
                student_id INT PRIMARY KEY,
                name VarChar(50),
                class VarChar(20),
                course_id INT,
                score FLOAT
               )''')
cursor.execute('''CREATE TABLE course(
                id INT PRIMARY KEY,
                course_name VarChar(20)
               )''')

In [5]:
#Chèn bản ghi vào bảng NhanVien
cursor.execute("""INSERT INTO student (student_id, name, class, course_id, score) VALUES
                (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7),
                (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2),
                (3, 'Pham Van Nam', 'Toan Tin', NULL, 7.9),
                (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2),
                (5, 'Vu Quoc Anh', 'May Tinh', 24, 8),
                (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5),
                (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2),
                (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8),
                (9, 'Duong Huu Phuc', 'Kinh Te', NULL, 7.2),
                (10, 'Cao Thi Hanh', 'May Tinh', NULL, 7.0)
                ;""")
cursor.execute("""INSERT INTO course (id, course_name) VALUES
                (12, 'Giai tich'),
                (34, 'Thong ke'),
                (26, 'Tin hoc')
                ;""")
conn.commit()

In [ ]:
# Sử dụng tích Descartes
cursor.execute("SELECT * FROM student, course")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong ke'),
 (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin hoc'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin hoc'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai tich'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong ke'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin hoc'),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai tich'),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong ke'),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin hoc'),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 12, 'Giai tich'),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 34, 'Thong ke'),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 26, 'Tin hoc'),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 12, 'Giai tich'),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 34, 'Thong ke'),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 26, 'Tin hoc'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai tich'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin hoc'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai tich'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong ke'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin hoc'),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 12, 'Giai tich'),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 34, 'Thong ke'),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 26, 'Tin hoc'),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 12, 'Giai tich'),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 34, 'Thong ke'),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 26, 'Tin hoc')]

In [ ]:
# Sử dụng INNER JOIN
cursor.execute("SELECT * FROM student INNER JOIN course ON student.course_id = course.id")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')]

In [ ]:
# Sử dụng LEFT JOIN
cursor.execute("SELECT * FROM student LEFT JOIN course ON student.course_id = course.id")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None, None),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None)]

In [ ]:
# Sử dụng RIGHT JOIN
cursor.execute("SELECT * FROM student RIGHT JOIN course ON student.course_id = course.id")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (None, None, None, None, None, 26, 'Tin hoc')]

In [ ]:
# Sử dụng FULL OUTER JOIN
cursor.execute("SELECT * FROM student FULL OUTER JOIN course ON student.course_id = course.id")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None, None),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None),
 (None, None, None, None, None, 26, 'Tin hoc')]

In [ ]:
# Cập nhật giá trị course_id còn thiếu trong bảng student
cursor.execute("""
UPDATE student
SET course_id = 26
WHERE course_id IS NULL;
""")
conn.commit()

cursor.execute("SELECT * FROM student")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2),
 (3, 'Pham Van Nam', 'Toan Tin', 26, 7.9),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8),
 (9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2),
 (10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0)]

In [ ]:
# Xóa bỏ các bản ghi tham gia các môn học không tồn tại trong bảng course
cursor.execute("""
DELETE FROM student 
WHERE course_id NOT IN (SELECT id FROM course)
""")
conn.commit()

cursor.execute("SELECT * FROM student")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2),
 (3, 'Pham Van Nam', 'Toan Tin', 26, 7.9),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2),
 (9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2),
 (10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0)]

In [14]:
# Tổng số sinh viên và điểm trung bình của cả lớp
cursor.execute("""
SELECT class, COUNT(*), AVG(score) FROM student
    GROUP BY class
""")
cursor.fetchall()

[('Kinh Te', 3, 8.533333333333333),
 ('May Tinh', 2, 6.85),
 ('Toan Tin', 1, 7.9)]

In [ ]:
# Tổng số học sinh và điểm trung bình của từng môn học
cursor.execute("""
SELECT c.course_name, COUNT(s.student_id), AVG(s.score)
FROM student s
JOIN course c ON s.course_id = c.id
GROUP BY c.course_name;
""")
cursor.fetchall()

[('Giai tich', 1, 6.7),
 ('Thong ke', 2, 9.2),
 ('Tin hoc', 3, 7.366666666666667)]

In [22]:
# Phân loại sinh viên theo điểm
cursor.execute("ALTER TABLE student ADD COLUMN rank VarChar(20) ")
cursor.execute("""            
UPDATE student SET rank = CASE
    WHEN score >= 9.0 THEN 'Xuất sắc'
    WHEN score >= 6.0 THEN 'Tốt'
    ELSE 'Kém'
END
""")
conn.commit()

cursor.execute("SELECT * FROM student")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Tốt'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Xuất sắc'),
 (3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 'Tốt'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Xuất sắc'),
 (9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 'Tốt'),
 (10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0, 'Tốt')]

In [23]:
# Xếp hạng học sinh theo điểm số
cursor.execute("SELECT * FROM student ORDER BY score DESC")
cursor.fetchall()

[(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Xuất sắc'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Xuất sắc'),
 (3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 'Tốt'),
 (9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 'Tốt'),
 (10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0, 'Tốt'),
 (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Tốt')]

In [29]:
# Xếp hạng điểm số học sinh theo lớp học
cursor.execute("SELECT * FROM student ORDER BY class, score DESC")
cursor.fetchall()

[(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Xuất sắc'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Xuất sắc'),
 (9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 'Tốt'),
 (10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0, 'Tốt'),
 (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Tốt'),
 (3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 'Tốt')]

In [30]:
# Xếp hạng điểm số học sinh theo mã môn học
cursor.execute("SELECT * FROM student ORDER BY course_id, score DESC")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Tốt'),
 (3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 'Tốt'),
 (9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 'Tốt'),
 (10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0, 'Tốt'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Xuất sắc'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Xuất sắc')]

In [ ]:
# Xếp hạng 3 học sinh điểm cao nhất.
cursor.execute("SELECT * FROM student ORDER BY score DESC LIMIT 3")
cursor.fetchall()

[(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Xuất sắc'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Xuất sắc'),
 (3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 'Tốt')]

In [ ]:
# Xếp hạng 3 học sinh điểm thấp nhất.
cursor.execute("SELECT * FROM student ORDER BY score ASC LIMIT 3")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Tốt'),
 (10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0, 'Tốt'),
 (9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 'Tốt')]

In [ ]:
# Tính thời gian tốt nghiệp
cursor.execute("ALTER TABLE student ADD COLUMN graduation_date DATETIME")
current_time = datetime.now()
rows = cursor.execute("SELECT * FROM student ORDER BY score DESC").fetchall()
for rank, row in enumerate(rows, start=1):
    graduation_date = current_time + timedelta(days=rank)
    # cursor.execute(f"""
    # UPDATE student
    # SET graduation_date = {graduation_date.strftime('%Y-%m-%d')}
    # WHERE student_id = {row[0]};
    # """)
    cursor.execute("UPDATE student SET graduation_date = ? WHERE student_id = ?", 
                   (graduation_date.strftime('%Y-%m-%d'), row[0]))
conn.commit()

cursor.execute("SELECT * FROM student")
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Tốt', '2025-03-19'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Xuất sắc', '2025-03-14'),
 (3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 'Tốt', '2025-03-16'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Xuất sắc', '2025-03-15'),
 (9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 'Tốt', '2025-03-17'),
 (10, 'Cao Thi Hanh', 'May Tinh', 26, 7.0, 'Tốt', '2025-03-18')]